ci4-backup/app/Controllers/Monitoring.php

        $data['monitoringList'] = $monitoringModel->orderBy('monitoring.activity_date', 'DESC')->findAll();

        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `name` ASC

    public function delete($id)
    {
        $monitoringModel = new MonitoringModel();
        $monitoring = $monitoringModel->find($id);

        if (!$monitoring) {
            return redirect()->to('/monitoring')->with('error', 'Data monitoring tidak ditemukan.');
        }

        // Access Control: Karyawan can only delete their own reports
        if (session()->get('role') === 'karyawan' && $monitoring['created_by'] != session()->get('id')) {
            return redirect()->to('/monitoring')->with('error', 'Akses ditolak.');
        }

        $date = $monitoring['activity_date'];
        $year = date('Y', strtotime($date));
        $month = (int)date('m', strtotime($date));
        $triwulan = ceil($month / 3);

        $monitoringModel->delete($id);
---
SELECT *
FROM `monitoring`
WHERE `monitoring`.`id` = '23'
DELETE FROM `monitoring`
WHERE `id` IN ('23')